Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTag.#ctor(Autodesk.Revit.DB.Structure.ReinforcementAbbreviationTagType,System.String)
Constructs a new ReinforcementAbbreviationTag.
typeTag:
Defines the type of abbreviation tag.
abbreviationTag:
Defines the abbreviation tag value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016